backend/app/controllers/attendees_controller.rb

INSERT INTO "attendees" ("user_id", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["event_id", 5], ["created_at", "2021-04-01 02:36:52.681307"], ["updated_at", "2021-04-01 02:36:52.681307"]]
---
  def createNewAttendee
    @attendee = Attendee.new(event_id: params[:event_id], user_id: params[:user_id])
    if @attendee.save

SELECT `attendees`.* FROM `attendees`
---
  def index
    @attendees = Attendee.all

SELECT  "attendees".* FROM "attendees" WHERE "attendees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @attendee = Attendee.find(params[:id])

INSERT INTO "attendees" ("user_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["event_id", 2], ["created_at", "2024-09-04 20:15:28.139733"], ["updated_at", "2024-09-04 20:15:28.139733"]]
---
  def create
    @attendee = Attendee.new(event_id: params[:event_id], user_id: params[:user_id])
    if @attendee.save

SELECT  "attendees".* FROM "attendees" WHERE "attendees"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "attendees" WHERE "attendees"."id" = ?  [["id", 2]]
---
  def destroy
    @attendee = Attendee.find(params[:id])
    if @attendee
        @attendee.destroy