backend/app/controllers/events_controller.rb

  def findAttendees
    searchResults = Attendee.where("event_id = ?", params[:event_id])
---
SELECT "attendees".* FROM "attendees" WHERE (event_id = '6')

  def findHosts
    searchResults = Host.where("event_id = ?", params[:event_id])
---
SELECT "hosts".* FROM "hosts" WHERE (event_id = '1')