backend/app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE "events"."latitude" BETWEEN ? AND ? AND "events"."longitude" BETWEEN ? AND ?  [["latitude", 34.39705631765737], ["latitude", 34.467848891369414], ["longitude", 34.39705631765737], ["longitude", 34.467848891369414]]
---
  def findNearby
    nearbyEvents = Event.where({latitude: params[:latitude_lower]..params[:latitude_upper], longitude: params[:longitude_lower]..params[:longitude_upper]})

INSERT INTO "events" ("event_name", "time", "created_at", "updated_at", "location", "latitude", "longitude") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def createNewEvent
    event = Event.new(event_name: params[:eventName], time: params[:time], location: params[:locationName], latitude: params[:latitude], longitude: params[:longitude])
    if event.save

SELECT "events".* FROM "events" WHERE (event_name LIKE '%TestingLocation%')
---
  def search
    searchResults = Event.where('event_name LIKE ?', "%#{params[:query_name]}%")

SELECT users.name FROM "attendees" LEFT JOIN users WHERE (event_id = '6')
SELECT users.id, users.name,attendees.event_id FROM "users" INNER JOIN "attendees" ON "attendees"."user_id" = "users"."id" WHERE (event_id = '5')
---
  def findAttendees
    searchResults = User.joins(:attendees).select('users.id, users.name,attendees.event_id').where("event_id = ?",params[:event_id])

SELECT users.id, users.name,attendees.event_id FROM "users" INNER JOIN "attendees" ON "attendees"."user_id" = "users"."id" WHERE (event_id = '5')
---
  def findHosts
    searchResults = User.joins(:hosts).select('users.id, users.name,hosts.event_id').where("event_id = ?",params[:event_id])

SELECT `events`.* FROM `events`
---
  def index
    events = Event.all

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
  def show
    event = Event.find(params[:id])

INSERT INTO `events` (`event_name`, `time`, `created_at`, `updated_at`, `location`, `latitude`, `longitude`) VALUES ('new', '2012-01-01 00:00:00', '2024-08-27 18:40:55', '2024-08-27 18:40:55', 'new_place!', 200.0, 200.0)
---
  def create
    event = Event.new(event_params)
    if event.save

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 1]]
---
  def destroy
    event = Event.find(params[:id])
    if event
        event.destroy