backend/app/controllers/hosts_controller.rb

INSERT INTO "events" ("event_name", "time", "created_at", "updated_at", "location", "latitude", "longitude") VALUES (?, ?, ?, ?, ?, ?, ?)
INSERT INTO "hosts" ("user_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["event_id", 1], ["created_at", "2024-09-04 19:46:01.085758"], ["updated_at", "2024-09-04 19:46:01.085758"]]
---
  def createNewHost
    host = Host.new(event_id: params[:event_id], user_id: params[:user_id])
    if host.save

SELECT `hosts`.* FROM `hosts`
---
  def index
    hosts = Host.all

SELECT  "hosts".* FROM "hosts" WHERE "hosts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    host = Host.find(params[:id])

INSERT INTO "hosts" ("user_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["event_id", 4], ["created_at", "2024-09-04 20:15:27.738886"], ["updated_at", "2024-09-04 20:15:27.738886"]]
---
  def create
    host = Host.new(host_params)
    if host.save

SELECT  "hosts".* FROM "hosts" WHERE "hosts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "hosts" WHERE "hosts"."id" = ?  [["id", 2]]
---
  def destroy
    host = Host.find(params[:id])
    if host
        host.destroy