backend/app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE (name = 'rijikashi' AND password = 'thewhip1')
SELECT  1 AS one FROM "users" WHERE (name = 'John' AND password = 'password') LIMIT ?  [["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE (name = 'Bob' AND password = 'Password')
---
  def authentication
    username = params[:username]
    password = params[:password]
    password = password[1,password.length-1]
    user = User.where("name = ? AND password = ?", params[:username], password)
    if user.empty?

INSERT INTO "users" ("name", "created_at", "updated_at", "age", "credibility", "password") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "testingone"], ["created_at", "2024-09-04 19:45:04.301924"], ["updated_at", "2024-09-04 19:45:04.301924"], ["age", 20], ["credibility", 7], ["password", "[FILTERED]"]]
---
  def createNewUser
    user = User.new(name: params[:username], password: params[:password], age: params[:age], credibility: 7)
    if user.save

SELECT `users`.* FROM `users`
---
  def index
    users = User.all

INSERT INTO "users" ("name", "created_at", "updated_at", "age", "credibility") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Luigi"], ["created_at", "2024-09-04 20:15:27.588941"], ["updated_at", "2024-09-04 20:15:27.588941"], ["age", 20], ["credibility", 10]]
---
  def create
    user = User.new(name: params[:name], age: params[:age], credibility: params[:credibility])
    if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
---
  def destroy
    user = User.find(params[:id])
    if user
        user.destroy